Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# agent.artifact.weekly.freshnessLimitation
source: Stars, descriptions, and topics may have changed after the snapshot time.
ar: يمكن أن تتغير النجوم، الوصفات، والمواضيع بعد وقت النسخ الاحتياطي.
de: Sterne, Beschreibungen und Themen können nach dem Snapshot-Zeitpunkt geändert worden sein.
es: Las estrellas, descripciones y temas pueden haber cambiado después del tiempo de la instantánea.
fr: Les étoiles, descriptions et sujets peuvent avoir changé après l'heure du snapshot.
id: Bintang, deskripsi, dan topik mungkin telah berubah setelah waktu snapshot.
it: Le stelle, le descrizioni e gli argomenti potrebbero essere cambiati dopo il tempo dello snapshot.
ja: スター、説明、およびトピックはスナップショット時間以降に変更される可能性があります。
ko: 별점, 설명 및 주제는 스냅샷 시간 이후 변경될 수 있습니다.
nl: Sterren, beschrijvingen en onderwerpen kunnen na het snapshot tijdstip gewijzigd zijn.
pl: Gwiazdki, opisy i tematy mogą ulec zmianie po czasie snapshotu.
pt_br: Estrelas, descrições e tópicos podem ter mudado após o tempo do snapshot.
ru: Звёзды, описания и темы могут измениться после времени снимка.
tr: Yıldızlar, açıklamalar ve konular görüntüleme zamanından sonra değişebilir.
uk: Зірки, описи та теми можуть змінитися після часу снимку.
vi: Stars, mô tả và chủ đề có thể đã thay đổi sau thời điểm snapshot.
zh_hans: Star 数、描述和主题可能在快照时间后发生变化。
zh_hant: Stars、描述和主題可能在快照時間之後變更。

# agent.artifact.weekly.metadataLimitation
source: Repository metadata comes from the frozen Starcat run context, not live GitHub.
ar: تأتي بيانات المخزن من سياق تشغيل Starcat المجمد وليس GitHub الحي.
de: Repository-Metadaten stammen aus dem eingefrorenen Starcat-Ausführungszusammenhang, nicht von live GitHub
es: Los metadatos del repositorio provienen del contexto de ejecución congelado de Starcat, no de GitHub en vivo
fr: Les métadonnées de dépôt proviennent du contexte d'exécution Starcat figé, pas de GitHub en direct
id: Metadata repositori berasal dari konteks *frozen* Starcat run, bukan GitHub langsung
it: I metadati del repository provengono dal contesto esecuzione congelato di Starcat, non da GitHub live
ja: リポジトリメタデータはフリーズされたStarcat実行コンテキストから取得されており、ライブGitHubではありません。
ko: 저장소 메타데이터는 동결된 Starcat 실행 컨텍스트에서 가져옵니다(실시간 GitHub이 아님).
nl: Repository metadata komt uit de gefreezeerde Starcat run context, niet live GitHub
pl: Metadane repozytorium pochodzą z kontekstu zamrożonego uruchomienia Starcat, nie z żywego GitHub
pt_br: Metadados do repositório vêm do contexto de execução congelada do Starcat, não do GitHub ao vivo
ru: Метаданные репозитория берутся из контекста замороженного запуска Starcat, а не из живого GitHub
tr: Depo metası donmuş Starcat çalışma bağlamından geliyor, canlı GitHub'dan değil.
uk: Метаінформація репозиторію береться з контексту замороженого запуску Starcat, а не з живого GitHub
vi: Metadata của kho lưu trữ lấy từ bối cảnh chạy Starcat đông lạnh, không phải GitHub trực tuyến
zh_hans: 仓库元数据来自冻结的 Starcat 运行上下文，而非实时 GitHub。
zh_hant: 倉庫元資料來自 Starcat 快照執行環境，非實時 GitHub。

# agent.artifact.weekly.overview
source: Overview
ar: مقدمة
de: Überblick
es: Vista general
fr: Aperçu
id: Ringkasan
it: Panoramica
ja: 概要
ko: 개요
nl: Overzicht
pl: Podsumowanie
pt_br: Visão Geral
ru: Обзор
tr: Genel Bakış
uk: Огляд
vi: Tổng quan
zh_hans: 概览
zh_hant: 概觀

# agent.externalSearch.log.disabledForRun
source: External Search is disabled for this run.
ar: بحث خارجي معطل لهذا التشغيل.
de: Externe Suche ist für diese Ausführung deaktiviert.
es: Búsqueda externa deshabilitada para esta ejecución.
fr: Recherche externe désactivée pour cette exécution.
id: Pencarian Eksternal dinonaktifkan untuk *run* ini.
it: Ricerca esterna disabilitata per questa esecuzione.
ja: この実行では外部検索が無効化されています。
ko: 외부 검색은 이 실행에 대해 비활성화되었습니다.
nl: Externe Zoekopdracht is uitgeschakeld voor deze run.
pl: Zewnętrzne Wyszukiwanie jest wyłączone dla tego uruchomienia.
pt_br: Busca Externa está desativada para esta execução.
ru: Внешний поиск отключен для этого запуска.
tr: Dışarıdan Arama bu çalışma için devre dışı bırakıldı.
uk: Зовнішній пошук відключено для цього запуску.
vi: Tìm kiếm ngoài trời bị vô hiệu hóa trong lần chạy này.
zh_hans: 本次运行已关闭外部搜索。
zh_hant: External Search 此次執行已停用。

# agent.externalSearch.log.disabledInSettings
source: External Search is disabled in Settings.
ar: بحث خارجي معطل في الإعدادات.
de: Externe Suche ist in den Einstellungen deaktiviert.
es: Búsqueda externa deshabilitada en Configuración.
fr: Recherche externe désactivée dans les Paramètres.
id: Pencarian Eksternal dinonaktifkan di Pengaturan.
it: Ricerca esterna disabilitata nelle Impostazioni.
ja: 設定で外部検索が無効化されています。
ko: 외부 검색이 설정에서 비활성화되어 있습니다.
nl: Externe Zoekopdracht is uitgeschakeld in Instellingen.
pl: Zewnętrzne Wyszukiwanie jest wyłączone w Ustawieniach.
pt_br: Busca Externa está desativada nas Configurações.
ru: Внешний поиск отключен в Настройках.
tr: Dışarıdan Arama Ayarlar'da devre dışı bırakıldı.
uk: Зовнішній пошук відключено в Налаштуваннях.
vi: Tìm kiếm ngoài trời bị vô hiệu hóa trong Cài đặt.
zh_hans: 设置中已关闭外部搜索。
zh_hant: External Search 在設定中已停用。

# agent.externalSearch.log.failedFormat
source: External Search failed: %@
ar: فشل بحث خارجي: %@
de: Externe Suche fehlgeschlagen: %@
es: La Búsqueda externa falló: %@
fr: Échec de la Recherche externe : %@
id: Gagal Pencarian Eksternal: %@
it: La Ricerca esterna ha fallito: %@
ja: 外部検索に失敗しました: %@
ko: 외부 검색 실패: %@
nl: Externe Zoekopdracht mislukt: %@
pl: Zewnętrzne Wyszukiwanie nieudane: %@
pt_br: Falha na Busca Externa: %@
ru: Ошибка внешнего поиска: %@
tr: Dışarıdan Arama başarısız oldu: %@
uk: Помилка зовнішнього пошуку: %@
vi: Lỗi Tìm kiếm ngoài trời: %@
zh_hans: 外部搜索失败：%@
zh_hant: 外部搜尋失敗：%@

# agent.externalSearch.log.privateRepositoriesBlockedFormat
source: External Search blocked private repositories: %@
ar: تم حظر البحث الخارجي على مستودعات خاصة: %@
de: Externe Suche blockiert private Repositories: %@
es: External Search bloqueó repositorios privados: %@
fr: Recherche externe bloquée pour les dépôts privés : %@
id: Pencarian Eksternal memblokir repositori privat: %@
it: Ricerche esterne bloccate per repository privati: %@
ja: 外部検索でプライベートリポジトリがブロックされました: %@
ko: 외부 검색에서 개인 저장소가 차단되었습니다: %@
nl: Externe Zoekopdracht blokkeert private repositories: %@
pl: Zablokowano dostęp do prywatnych repozytoriów w zewnętrznym wyszukiwaniu: %@
pt_br: External Search bloqueou repositórios privados: %@
ru: External Search заблокировал доступ к закрытым репозиториям: %@
tr: Harici Arama özel depoları engelledi: %@
uk: Зовнішній пошук заблокував приватні репозиторії: %@
vi: Tìm kiếm bên ngoài bị chặn kho lưu trữ riêng tư: %@
zh_hans: 外部搜索已阻止私有仓库：%@
zh_hant: 外部搜尋已封鎖私有倉庫：%@

# agent.externalSearch.log.unconfigured
source: External Search is not configured for this runtime.
ar: لم يتم تكوين بحث خارجي لهذا بيئة التنفيذ.
de: Externe Suche ist für diese Laufzeit nicht konfiguriert.
es: External Search no está configurado para este entorno de ejecución.
fr: La Recherche externe n'est pas configurée pour ce runtime.
id: Pencarian Eksternal tidak dikonfigurasi untuk runtime ini.
it: External Search non configurato per questa esecuzione.
ja: このランタイムでは External Search が構成されていません。
ko: 이 런타임에 대해 외부 검색이 구성되지 않았습니다.
nl: Externe Zoekopdracht is niet geconfigureerd voor deze runtime.
pl: Zewnętrzne Wyszukiwanie nie jest skonfigurowane dla tego środowiska wykonawczego.
pt_br: External Search não está configurado para este ambiente de execução.
ru: External Search не настроен для текущей среды выполнения.
tr: Bu çalışma zamanı için Harici Arama yapılandırılmamıştır.
uk: Зовнішній пошук не налаштований для цього запуску.
vi: Tìm kiếm bên ngoài chưa được cấu hình cho runtime này.
zh_hans: 当前运行时未配置外部搜索。
zh_hant: 此執行環境未設定外部搜尋。

# agent.externalSearch.log.unknownRepositoriesFormat
source: Unknown Agent repository IDs: %@
ar: معرفات مستودعات الوكيل غير معروفة: %@
de: Unbekannte Agent-Repository-Kennungen: %@
es: IDs de repositorio desconocidos del Agent: %@
fr: Identifiants de dépôt Agent inconnus : %@
id: ID Repositori Agent yang tidak dikenal: %@
it: ID repository Agent sconosciuti: %@
ja: 不明な Agent リポジトリ ID: %@
ko: 알 수 없는 Agent 저장소 ID: %@
nl: Onbekende Agent-repository IDs: %@
pl: Nieznane ID repozytoriów Agent: %@
pt_br: IDs de repositório desconhecidos do Agent: %@
ru: Неизвестные ID репозиториев Agent: %@
tr: Bilinmeyen Agent deposu kimlikleri: %@
uk: Невідомі ID репозиторіїв Agent: %@
vi: ID kho lưu trữ Agent không xác định: %@
zh_hans: 未知的 Agent 仓库 ID：%@
zh_hant: 未知的 Agent 倉庫 ID：%@

# agent.externalSearch.summary.sourcesFormat
source: %d sources
ar: %d مصدرًا
de: %d Quellen
es: %d fuentes
id: %d sumber
it: %d fonti
ja: %d ソース
ko: %d개의 소스
nl: %d bronnen
pl: %d źródeł
pt_br: %d fontes
ru: %d источников
tr: %d kaynak
uk: %d джерел
vi: %d nguồn
zh_hans: %d 个来源
zh_hant: %d 個來源

# agent.knowledge.error.emptyQuery
source: Knowledge search query cannot be empty.
ar: لا يمكن أن يكون استعلام بحث المعرفة فارغًا.
de: Wissenssuche-Abfrage darf nicht leer sein.
es: La consulta de búsqueda de conocimiento no puede estar vacía.
fr: La requête de recherche dans les connaissances ne peut pas être vide.
id: Pertanyaan pencarian pengetahuan tidak boleh kosong.
it: La query di ricerca della conoscenza non può essere vuota.
ja: Knowledge 検索クエリは空にできません。
ko: 지식 검색 쿼리가 비어 있습니다.
nl: Kenniszoekopdracht mag niet leeg zijn.
pl: Zapytanie wyszukiwania wiedzy nie może być puste.
pt_br: A consulta de conhecimento não pode estar vazia.
ru: Запрос поиска знаний не может быть пустым.
tr: Bilgi arama sorgusu boş olamaz.
uk: Запит пошуку знань не може бути порожнім.
vi: Query tìm kiếm tri thức không thể để trống.
zh_hans: 知识搜索问题不能为空。
zh_hant: 知識搜尋查詢不能為空。

# agent.knowledge.error.emptyRepositoryScope
source: No repositories in this run are available for knowledge search.
ar: لم يتم تحديد أي مستودعات في هذا التنفيذ لاستخدامها في بحث المعرفة.
de: Keine Repositories in dieser Ausführung stehen für die Wissenssuche zur Verfügung.
es: No hay repositorios disponibles en esta ejecución para la búsqueda de conocimiento.
fr: Aucun dépôt n'est disponible pour la recherche dans les connaissances dans ce run.
id: Tidak ada repositori dalam runtime ini yang tersedia untuk pencarian pengetahuan.
it: Nessun repository in questa esecuzione è disponibile per la ricerca della conoscenza.
ja: このランタイムのリポジトリで Knowledge 検索が利用可能ありません。
ko: 현재 런타임의 지식 검색에 사용할 저장소가 없습니다.
nl: Geen repositories beschikbaar in deze run voor kenniszoeken.
pl: W żadnym repozytorium z tego uruchomienia nie ma dostępu do wyszukiwania wiedzy.
pt_br: Nenhum repositório está disponível para busca de conhecimento nesta execução.
ru: В текущей сессии нет доступных репозиториев для поиска знаний.
tr: Bu çalışma zamanında bilgi arayışı için uygun depolar bulunmuyor.
uk: У цьому запуску немає доступних репозиторіїв для пошуку знань.
vi: Không có kho nào trong runtime này phù hợp cho tìm kiếm tri thức.
zh_hans: 本次运行中没有可用于知识搜索的仓库。
zh_hant: 此執行環境中無可用倉庫進行知識搜尋。

# agent.knowledge.error.repositoryScopeChanged
source: The knowledge scope changed; search stopped without widening access.
ar: تغير نطاق المعرفة؛ توقف البحث دون توسيع الوصول.
de: Der Wissensumfang hat sich geändert; Suche wurde ohne Erweiterung des Zugriffs beendet.
es: El alcance del conocimiento cambió; se detuvo la búsqueda sin ampliar el acceso.
fr: L'étendue des connaissances a changé ; la recherche s'est arrêtée sans élargir l'accès.
id: Batasan pengetahuan berubah; pencarian dihentikan tanpa memperluas akses.
it: Lo scope della conoscenza è cambiato; ricerca interrotta senza ampliare l'accesso.
ja: Knowledge スコープが変更されました; アクセス拡大なしで検索停止。
ko: 지식 범위가 변경되었습니다; 접근을 넓히지 않고 검색이 종료되었습니다.
nl: De kennisbereik is gewijzigd; zoekopdracht gestopt zonder uitbreiding van toegang.
pl: Zmienił się zakres wiedzy; wyszukiwanie zakończono bez poszerzenia dostępu.
pt_br: O escopo do conhecimento mudou; a busca foi interrompida sem ampliar o acesso.
ru: Область поиска знаний изменилась; поиск завершён без расширения доступа.
tr: Bilgi kapsamı değişti; genişletilmiş erişim olmadan arama durduruldu.
uk: Сфера дії знань змінилася; пошук припинено без розширення доступу.
vi: Phạm vi tri thức đã thay đổi; tìm kiếm ngừng mà không mở rộng quyền truy cập.
zh_hans: 知识范围已变化；搜索已停止，且未扩大访问范围。
zh_hant: 知識範圍已變更；搜尋在未擴大存取權限下停止。

# agent.knowledge.error.unavailable
source: Agent knowledge retrieval is unavailable in the current runtime.
ar: استرجاع معلومات الوكيل غير متاح حاليًا في بيئة التنفيذ الحالية.
de: Wiederaufruf von Agent-Wissen ist in der aktuellen Laufzeit nicht verfügbar.
es: La recuperación de conocimiento del Agent no está disponible en este entorno de ejecución.
fr: La récupération des connaissances de l'Agent n'est pas disponible dans le runtime actuel.
id: Pengambilan pengetahuan Agent tidak tersedia dalam runtime saat ini.
it: La recupero della conoscenza dell'Agent non è disponibile in questa esecuzione.
ja: 現在のランタイムでは Agent の Knowledge 検索が利用できません。
ko: 현재 런타임에서는 Agent 지식을 가져올 수 없습니다.
nl: Agent-kennisophaalprocedure niet beschikbaar in de huidige runtime.
pl: Pobieranie wiedzy Agent jest niedostępne w bieżącym środowisku wykonawczym.
pt_br: A recuperação de conhecimento do Agent não está disponível neste ambiente de execução.
ru: Получение знаний Agent недоступно в текущей среде выполнения.
tr: Mevcut çalışma zamanı içinde Agent bilgi alınması kullanılmaz.
uk: Отримання знань Agent недоступне в поточному середовищі виконання.
vi: Lấy tri thức từ Agent không khả dụng trong runtime hiện tại.
zh_hans: 当前运行时无法使用 Agent 知识检索。
zh_hant: 目前執行環境無法使用 Agent 知識檢索功能。

# agent.knowledge.log.reused
source: Reused Knowledge RAG retrieval inside the eligible frozen scope.
ar: استخدم استرجاع RAG للمعرفة داخل نطاق التجميد المؤهل.
de: Wiederverwendetes Wissen-RAG im gültigen eingefrorenen Umfang.
es: Reutilizó la recuperación RAG de Conocimiento dentro del alcance congelado elegible.
fr: Réutilisation de la récupération RAG des Connaissances dans la portée gelée éligible.
id: Menggunakan kembali pengambilan RAG Pengetahuan di dalam batasan lingkup yang dibekukan.
it: Riproposto il recupero RAG della Conoscenza all'interno dello scope congelato valido.
ja: 有効範囲内の凍結スコープで再利用された Knowledge RAG 検索。
ko: 유효한 범위 내에서 지식 RAG 재사용.
nl: Hergebruikt Kennis RAG-ophaalprocedure binnen het gekoelde bereik.
pl: Z powtórzeniem pobrania RAG z wiedzy w obrębie ustalonego zakresu.
pt_br: Reutilizou recuperação RAG de Conhecimento dentro do escopo congelado elegível.
ru: Использованы повторно данные RAG из доступной замороженной области поиска.
tr: Eligible frozen scope içindeki yeniden kullanılan Knowledge RAG alınması.
uk: Повторно використано отримання RAG-знань у межах допустимої замороженої сфери дії.
vi: Tái sử dụng Lấy tri thức RAG trong phạm vi đông lạnh phù hợp.
zh_hans: 在符合条件的冻结范围内复用了 Knowledge RAG 检索。
zh_hant: 在合格的凍結範圍內重複使用 Knowledge RAG 檢索。

# agent.knowledge.summaryFormat
source: %d evidence blocks · %d citations
ar: %d كتلة دليل · %d مراجع
de: %d Beweisanhänge · %d Zitate
es: %d bloques de evidencia · %d citas
fr: %d blocs d'évidence · %d citations
id: %d blok bukti · %d kutipan
it: %d blocchi di evidenza · %d citazioni
ja: %d 個のエビデンスブロック · %d 引用
ko: %d개의 증거 블록 · %d개의 인용
nl: %d bewijsblokken · %d citaties
pl: %d bloków dowodowych · %d cytatów
pt_br: %d blocos de evidência · %d citações
ru: %d блоков доказательств · %d цитат
tr: %d kanıt bloğu · %d alıntı
uk: %d блоків доказів · %d посилань
vi: %d khối chứng cứ · %d trích dẫn
zh_hans: %d 个证据块 · %d 个引用
zh_hant: %d 個證據區塊 · %d 次引用

# agent.repoInsight.tool.log.artifactBuilt
source: Validated the repository reference and built the final Repo Insight artifact.
ar: تم التحقق من المرجعية للمستودع وتجميع المنتج النهائي لـ Repo Insight.
de: Repository-Referenz validiert und das finale Repo Insight-Artifact erstellt.
es: Validó la referencia del repositorio y construyó el artefacto final de Repo Insight.
fr: Validation de la référence du dépôt et construction de l'artéfact final Repo Insight.
id: Validasi referensi repositori dan pembuatan artefak Repo Insight akhir.
it: Validato la riferimento del repository e costruito l'articolo finale Repo Insight.
ja: リポジトリ参照を検証し、最終的な Repo Insight アーティファクトを構築しました。
ko: 저장소 참조를 검증하고 최종 Repo Insight 아티팩트를 생성했습니다.
nl: Geverifieerd repository-verwijzing en gebouwd eind Repo Insight-artikel.
pl: Zweryfikowano referencję repozytorium i zbudowano ostateczny artefakt Repo Insight.
pt_br: Validou a referência do repositório e construiu o artefato final Repo Insight.
ru: Проверено ссылочное значение репозитория и создан финальный артефакт Repo Insight.
tr: Depo referansı doğrulanıp son Repo Insight sanatı oluşturuldu.
uk: Перевірено посилання на репозиторій та побудовано остаточний артефакт Repo Insight.
vi: Xác minh tham chiếu kho lưu trữ và xây dựng thành phẩm Repo Insight cuối cùng.
zh_hans: 已验证仓库引用并生成最终仓库洞察产出物。
zh_hant: 驗證倉庫參考並建立最終 Repo Insight 產物。

# agent.repoInsight.tool.log.goalParsed
source: Parsed the Repo Insight goal without write-capable actions.
ar: تم تحليل هدف Repo Insight دون إجراء أي إجراءات كتابية.
de: Repo Insight-Ziel ohne schreibfähige Aktionen geparsed.
es: Analizó el objetivo de Repo Insight sin acciones con capacidad de escritura.
fr: Analyse des objectifs Repo Insight sans actions modifiables.
id: Memparsing tujuan Repo Insight tanpa tindakan yang dapat ditulis.
it: Analizzato il goal di Repo Insight senza azioni con capacità di scrittura.
ja: 書き込み可能なアクションなしで Repo Insight の目標を解析しました。
ko: 쓰기 가능한 액션 없이 Repo Insight 목표를 파싱했습니다.
nl: Geparseerde Repo Insight-doelstelling zonder schrijfbevoegdheden acties.
pl: Przetworzono cel Repo Insight bez działań z możliwością zapisu.
pt_br: Parseou o objetivo do Repo Insight sem ações com capacidade de escrita.
ru: Распарсен целевой запрос Repo Insight без действий на запись.
tr: Yazma yeteneği olmayan eylemler olmadan Repo Insight hedefi parse edildi.
uk: Розпарсовано мету Repo Insight без дій з можливістю запису.
vi: Phân tích mục tiêu Repo Insight mà không có hành động ghi được.
zh_hans: 已解析仓库洞察目标，未执行写入操作。
zh_hant: 解析 Repo Insight 目標，未包含可寫入動作。

# agent.repoInsight.tool.log.repositorySelected
source: Selected the target repository from the frozen run context.
ar: تم اختيار المستودع الهدف من سياق التنفيذ المجمد.
de: Ziel-Repository aus dem eingefrorenen Ausführungs-Kontext ausgewählt.
es: Seleccionó el repositorio objetivo del contexto de ejecución congelado.
fr: Sélection du dépôt cible depuis le contexte de run gelé.
id: Memilih repositori target dari konteks runtime yang dibekukan.
it: Selezionato il repository target dal contesto di esecuzione congelato.
ja: 凍結ランタイムコンテキストからターゲットリポジトリを選択しました。
ko: 동결된 런타임 컨텍스트에서 대상 저장소를 선택했습니다.
nl: Geselecteerd doel-repository uit de gekoelde run-context.
pl: Zostało wybranie docelowego repozytorium z zamrożonego kontekstu wykonania.
pt_br: Selecionou o repositório alvo do contexto da execução congelada.
ru: Выбран целевой репозиторий из контекста замороженной сессии.
tr: Donmuş çalışma zamanı bağlamından hedef depo seçildi.
uk: Вибрано цільовий репозиторій із замороженого контексту запуску.
vi: Chọn kho lưu trữ đích từ ngữ cảnh runtime đông lạnh.
zh_hans: 已从冻结运行上下文选择目标仓库。
zh_hant: 從凍結執行環境選取目標倉庫。

# agent.trace.kind.tool
source: Tool
ar: Starcat
es: Starcat
id: Starcat Tool
pl: Starcat Tool
tr: Starcat
uk: Starcat Tool
zh_hans: 工具
zh_hant: Starcat

# agent.weekly.tool.log.artifactBuilt
source: Validated repository references and built the final weekly report artifact.
ar: تم التحقق من مراجع المستودعات وتجميع المنتج النهائي لل تقرير الأسبوعي.
de: Repository-Referenzen validiert und das finale wöchentliche Berichts-Artifact erstellt.
es: Validó las referencias de repositorios y construyó el artefacto final del informe semanal.
fr: Validation des références de dépôt et construction de l'artéfact final du rapport hebdomadaire.
id: Validasi referensi repositori dan pembuatan artefak laporan mingguan akhir.
it: Validati i riferimenti dei repository e costruito l'articolo finale del report settimanale.
ja: リポジトリ参照を検証し、最終的な週次レポートアーティファクトを構築しました。
ko: 저장소 참조를 검증하고 최종 주간 보고서 아티팩트를 생성했습니다.
nl: Geverifieerde repository-verwijzingen en gebouwd eind wekelijkse rapport-artikel.
pl: Zweryfikowano referencje repozytoriów i zbudowano ostateczny artefakt raportu tygodniowego.
pt_br: Validou referências de repositórios e construiu o artefato final do relatório semanal.
ru: Проверены ссылки на репозитории и создан финальный артефакт еженедельного отчёта.
tr: Depo referansları doğrulanıp son haftalık rapor sanatı oluşturuldu.
uk: Перевірено посилання на репозиторії та побудовано остаточний артефакт щомісячного звіту.
vi: Xác minh tham chiếu kho lưu trữ và xây dựng thành phẩm báo cáo tuần cuối cùng.
zh_hans: 已验证仓库引用并生成最终周报产出物。
zh_hant: 驗證倉庫參考並建立最終週報產物。

# agent.weekly.tool.log.goalParsed
source: Parsed the weekly report goal without write-capable actions.
ar: تم تحليل هدف التقرير الأسبوعي دون إجراء أي إجراءات كتابية.
de: Wochenbericht-Ziel ohne schreibfähige Aktionen geparsed.
es: Analizó el objetivo del informe semanal sin acciones con capacidad de escritura.
fr: Analyse de l'objectif du rapport hebdomadaire sans actions modifiables.
id: Memparsing tujuan laporan mingguan tanpa tindakan yang dapat ditulis.
it: Analizzato il goal del report settimanale senza azioni con capacità di scrittura.
ja: 書き込み可能なアクションなしで週次レポートの目標を解析しました。
ko: 쓰기 가능한 액션 없이 주간 보고서 목표를 파싱했습니다.
nl: Geparseerde wekelijkse rapport-doelstelling zonder schrijfbevoegdheden acties.
pl: Przetworzono cel raportu tygodniowego bez działań z możliwością zapisu.
pt_br: Parseou o objetivo do relatório semanal sem ações com capacidade de escrita.
ru: Распарсен целевой запрос еженедельного отчёта без действий на запись.
tr: Yazma yeteneği olmayan eylemler olmadan haftalık rapor hedefi parse edildi.
uk: Розпарсовано мету щомісячного звіту без дій з можливістю запису.
vi: Phân tích mục tiêu báo cáo tuần mà không có hành động ghi được.
zh_hans: 已解析周报目标，未执行写入操作。
zh_hant: 解析週報目標，未包含可寫入動作。

# agent.weekly.tool.log.repositoriesResolved
source: Resolved repositories from the frozen run context.
ar: تم حل مستودعات من سياق التنفيذ المجمد.
de: Repositories aus dem eingefrorenen Ausführungs-Kontext aufgelöst.
es: Resolvió los repositorios del contexto de ejecución congelado.
fr: Résolution des dépôts depuis le contexte de run gelé.
id: Menyelesaikan repositori dari konteks runtime yang dibekukan.
it: Risolti i repository dal contesto di esecuzione congelato.
ja: 凍結ランタイムコンテキストからリポジトリを解決しました。
ko: 동결된 런타임 컨텍스트에서 저장소를 해결했습니다.
nl: Opgeloste repositories uit de gekoelde run-context.
pl: Rozstrzygnięto repozytoria z zamrożonego kontekstu wykonania.
pt_br: Resolveu repositórios do contexto da execução congelada.
ru: Репозитории разрешены из контекста замороженной сессии.
tr: Donmuş çalışma zamanı bağlamından depolar çözüldü.
uk: Вирішено репозиторії із замороженого контексту запуску.
vi: Giải quyết kho từ ngữ cảnh runtime đông lạnh.
zh_hans: 已从冻结运行上下文解析仓库。
zh_hant: 從凍結執行環境解析倉庫。
